================================================================================
Single atom entry (implicit unit value)
================================================================================

{
    enabled
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Two atom entry (key value)
================================================================================

{
    host localhost
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Simple key-value entry
================================================================================

{
    server localhost
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (scalar
              (bare_scalar))))))))

================================================================================
Entry with tag as value
================================================================================

{
    status @ok
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            tag: (tag)))))))

================================================================================
Entry with unit as explicit value
================================================================================

{
    optional @
}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (unit)))))))

================================================================================
Top-level entries (implicit root object)
================================================================================

host localhost
port 8080

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (scalar
        (bare_scalar)))
    value: (expr
      payload: (scalar
        (bare_scalar))))
  (entry
    key: (expr
      payload: (scalar
        (bare_scalar)))
    value: (expr
      payload: (scalar
        (bare_scalar)))))

================================================================================
Tagged key with scalar value (schema declaration)
================================================================================

@schema path/to/schema.styx

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      tag: (tag))
    value: (expr
      payload: (scalar
        (bare_scalar)))))

================================================================================
Unit key with tagged value (root type in schema)
================================================================================

@ @object{name @string}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (unit))
    value: (expr
      tag: (tag)
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            tag: (tag)))))))

================================================================================
Tagged key with object value (inline schema)
================================================================================

@schema {schema {@ @object{host @string}}}

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      tag: (tag))
    value: (expr
      payload: (object
        (entry
          key: (expr
            payload: (scalar
              (bare_scalar)))
          value: (expr
            payload: (object
              (entry
                key: (expr
                  payload: (unit))
                value: (expr
                  tag: (tag)
                  payload: (object
                    (entry
                      key: (expr
                        payload: (scalar
                          (bare_scalar)))
                      value: (expr
                        tag: (tag)))))))))))))

================================================================================
Quoted key
================================================================================

"key with spaces" value

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (scalar
        (quoted_scalar)))
    value: (expr
      payload: (scalar
        (bare_scalar)))))

================================================================================
Tagged quoted key
================================================================================

@foo"bar" value

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      tag: (tag)
      payload: (scalar
        (quoted_scalar)))
    value: (expr
      payload: (scalar
        (bare_scalar)))))

================================================================================
Sequence as key (path syntax)
================================================================================

(a b) value

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          payload: (scalar
            (bare_scalar)))))
    value: (expr
      payload: (scalar
        (bare_scalar)))))

================================================================================
Path with three elements
================================================================================

(a b c) deep

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          payload: (scalar
            (bare_scalar)))))
    value: (expr
      payload: (scalar
        (bare_scalar)))))

================================================================================
Path with implicit unit value
================================================================================

(enabled flag)

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          payload: (scalar
            (bare_scalar)))))))

================================================================================
Path with tag element
================================================================================

(a @tag b) value

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          tag: (tag))
        (expr
          payload: (scalar
            (bare_scalar)))))
    value: (expr
      payload: (scalar
        (bare_scalar)))))

================================================================================
Path with attributes as value
================================================================================

(selector matchLabels) app>web

--------------------------------------------------------------------------------

(document
  (entry
    key: (expr
      payload: (sequence
        (expr
          payload: (scalar
            (bare_scalar)))
        (expr
          payload: (scalar
            (bare_scalar)))))
    value: (expr
      (attributes
        (attribute
          key: (bare_scalar)
          value: (bare_scalar))))))
